### Series, DataFrame

### Exploratory Data Analysis

In [1]:
import pandas as pd
import numpy as np

#### Series

In [2]:
mydata = ["Linear regression", "Logistic regression", "SVM", "PCA"]

In [3]:
myseries1 = pd.Series(mydata)

In [4]:
myseries1

0      Linear regression
1    Logistic regression
2                    SVM
3                    PCA
dtype: object

In [5]:
type(myseries1)

pandas.core.series.Series

In [6]:
myseries1[0]

'Linear regression'

In [7]:
data = [34, 2, 5, 45]

In [8]:
myseries2 = pd.Series(data)

In [10]:
type(myseries2)

pandas.core.series.Series

#### DataFrame

In [11]:
my_dfdata = mydata = [("Linear regression", 34), ("Logistic regression", 2), ("SVM", 5), ("PCA", 45)]

In [14]:
mydf = pd.DataFrame(my_dfdata)
mydf

                     0   1
0    Linear regression  34
1  Logistic regression   2
2                  SVM   5
3                  PCA  45

In [15]:
mydf = pd.DataFrame(my_dfdata, columns = ["Algo_name", "Number"])
mydf

             Algo_name  Number
0    Linear regression      34
1  Logistic regression       2
2                  SVM       5
3                  PCA      45

In [16]:
mydf["Algo_name"]

0      Linear regression
1    Logistic regression
2                    SVM
3                    PCA
Name: Algo_name, dtype: object

In [17]:
type(mydf["Algo_name"])

pandas.core.series.Series

In [18]:
mydf.Algo_name

0      Linear regression
1    Logistic regression
2                    SVM
3                    PCA
Name: Algo_name, dtype: object

In [19]:
mydf.loc[0]

Algo_name    Linear regression
Number                      34
Name: 0, dtype: object

#### Read CSV

In [24]:
df = pd.read_csv('data.csv')
df

            name                          email           phone  favorite
0  Allen Raymond      nulla.ante@vestibul.co.uk  (992) 914-3792     False
1    Chaim Lewis            dui.in@egetlacus.ca  (294) 840-6685     False
2   Kennedy Lane  mattis.Cras@nonenimMauris.net  (542) 451-7038      True
3     Wylie Pope              est@utquamvel.net  (692) 802-2949     False
4  Cyrus Jackson         nibh@semsempererat.com  (501) 472-5218      True

In [25]:
df.head(2)

            name                      email           phone  favorite
0  Allen Raymond  nulla.ante@vestibul.co.uk  (992) 914-3792     False
1    Chaim Lewis        dui.in@egetlacus.ca  (294) 840-6685     False

In [26]:
df.tail(2)

            name                   email           phone  favorite
3     Wylie Pope       est@utquamvel.net  (692) 802-2949     False
4  Cyrus Jackson  nibh@semsempererat.com  (501) 472-5218      True

In [27]:
df.shape

(5, 4)

In [29]:
df.columns

Index(['name', 'email', 'phone', 'favorite'], dtype='object')

In [31]:
new_df = df[['name', 'phone', 'favorite']]

In [32]:
new_df

            name           phone  favorite
0  Allen Raymond  (992) 914-3792     False
1    Chaim Lewis  (294) 840-6685     False
2   Kennedy Lane  (542) 451-7038      True
3     Wylie Pope  (692) 802-2949     False
4  Cyrus Jackson  (501) 472-5218      True

In [34]:
df.dtypes

name        object
email       object
phone       object
favorite      bool
dtype: object

In [36]:
df.describe()

                 name                      email           phone favorite
count               5                          5               5        5
unique              5                          5               5        2
top     Allen Raymond  nulla.ante@vestibul.co.uk  (992) 914-3792    False
freq                1                          1               1        3

In [37]:
df["email"]

0        nulla.ante@vestibul.co.uk
1              dui.in@egetlacus.ca
2    mattis.Cras@nonenimMauris.net
3                est@utquamvel.net
4           nibh@semsempererat.com
Name: email, dtype: object

In [38]:
df.loc[:0]

            name                      email           phone  favorite
0  Allen Raymond  nulla.ante@vestibul.co.uk  (992) 914-3792     False

In [40]:
df.favorite.values

array([False, False,  True, False,  True])

In [41]:
len(set(df.favorite.values))

2

In [42]:
new_df2 = df.set_index("name")
new_df2

                                       email           phone  favorite
name
Allen Raymond      nulla.ante@vestibul.co.uk  (992) 914-3792     False
Chaim Lewis              dui.in@egetlacus.ca  (294) 840-6685     False
Kennedy Lane   mattis.Cras@nonenimMauris.net  (542) 451-7038      True
Wylie Pope                 est@utquamvel.net  (692) 802-2949     False
Cyrus Jackson         nibh@semsempererat.com  (501) 472-5218      True

In [43]:
# new_df2.loc[0] = KeyError
new_df2.loc["Chaim Lewis"]

email       dui.in@egetlacus.ca
phone            (294) 840-6685
favorite                  False
Name: Chaim Lewis, dtype: object

In [44]:
new_df2.iloc[0]

email       nulla.ante@vestibul.co.uk
phone                  (992) 914-3792
favorite                        False
Name: Allen Raymond, dtype: object